tap "fluxcd/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "johanhaleby/kubetail"
tap "whiteducksoftware/tap"


# VScode
cask "visual-studio-code"

# Azure
brew "azcopy"
brew "azure-cli"
brew "whiteducksoftware/tap/azctx"

# GitHub
brew "gh"

# K8s
brew "k8sgpt"
brew "kubernetes-cli"
brew "kubectx"
brew "helm"
brew "helm-docs"
brew "kustomize"
brew "cilium-cli"
brew "tetra"
brew "hubble"
brew "fluxcd/tap/flux"
brew "johanhaleby/kubetail/kubetail"

# Containers
brew "kind"
brew "crane"

# Terraform
brew "terraform-docs"
brew "tfenv"
brew "tflint"

# Development
brew "go"
cask "dotnet-sdk"
cask "powershell"

# Security
brew "dependabot"
brew "renovate"
brew "checkov"

# AI
brew "ollama", restart_service: :changed

# Common
brew "git"
brew "base64"
brew "bitwarden-cli"
brew "jq"
brew "just"
brew "tmux"
brew "tree"
brew "watch"
brew "yq"




















